Revit 2027 API
BuiltInFailures.ImageFailures Class
 Failures about Image.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ImageFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ImageFailures
Public NotInheritable Class ImageFailures
public ref class ImageFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ImageFailures = class end
The BuiltInFailures.ImageFailures type exposes the following members.
Properties
Name | Description
BadViewType |  Image Instances can't be placed in 3D Views.
InvalidHeight |  The image height must be must be no more than 30000 feet.
InvalidWidth |  The image width must be must be no more than 30000 feet.
Top
See Also
Reference
Autodesk.Revit.DB Namespace